Repository: haruyama/ssh_rfc_ja
Catalog: omegat/ssh/ssh-level2.tmx
Source language: en_us
Languages: ja

source: There MAY be multiple host keys for a host, possibly with different algorithms.
ja: ホストに対して, 場合によっては異なるアルゴリズムを用いる, 複数のホスト鍵があってもよい.

source: If tmSameSecurity is true and there is no existing session with a matching tmSessionID, tmSecurityName, and tmTransportAddress, then increment the snmpSshtmSessionNoSessions counter, discard the message, and return the error indication in the statusInformation.
ja: tmSameSecurity が true で tmSessionID, tmSecurityName, tmTransportAddress に一致する既存のセッションがなければ, snmpSshtmSessionInvalidCaches カウンタをインクリメントし, メッセージを捨て,statusInformation の中のエラー表示を返す.

source: The following table identifies the initial assignments of the MAC Algorithm Names.
ja: 次の表で, MACアルゴリズムの名前の初期の割り当てを示す.

source: In addition to the above, there is a range of message numbers (60 to 79) reserved for method-specific messages.
ja: 上記に加えて, 60 から 79 までの範囲のメッセージ番号は, 認証法に依存するメッセージに予約されている.

source: The block_counter is initially set to one (1) and incremented as each block of key is produced.
ja: block_counter は, 最初 1 に設定され, ブロック鍵が生成される度にインクリメントされる.

source: In these algorithms, a public key is stored in an X.509v3 certificate.
ja: これらのアルゴリズムでは, 公開鍵は X.509v3 証明書に格納される.

source: The message-digest algorithm is presumed to produce an opaque octet string output, which is placed as-is in the RDATA fingerprint field.
ja: メッセージダイジェストアルゴリズムは, 不透明な(バイナリの?)オクテット文字列の出力をすると仮定される. これは, そのまま RDATA の指紋のフィールドに配置される.

source: The algorithm from the SHA2 family that will be used is chosen based on the size of the named curve specified for use with ECMQV by the chosen public key algorithm according to the table in Section 6.2.1.
ja: SHA2ファミリからどのアルゴリズムが選ばれるかは, 6.2.1節の表に基づいて, ECMQVと共に用いられる公開鍵アルゴリズムで指定された曲線のサイズを元に決められる.

source: Binary Packet Protocol
ja: バイナリパケットプロトコル

source: This message MUST be sent only if GSS_Init_sec_context() returned GSS_S_COMPLETE.
ja: GSS_Init_sec_context() が GSS_S_COMPLETE を返した場合のみ, このメッセージを送らなければならない.

source: All input and output from these SHOULD be redirected to the channel or to the encrypted tunnel.
ja: シェルやプログラムからのすべての入力と出力は, チャンネルか暗号化されたトンネルにリダイレクトされる必要がある.

source: Policy Issues ..............................................6 4.4.
ja: ポリシーの問題 ..............................................6 4.4.

source: Security Considerations ........................................13 9.
ja: セキュリティの考察 ........................................13 9.

source: The Diffie-Hellman (DH) key exchange provides a shared secret that cannot be determined by either party alone.
ja: Diffie-Hellman (DH) 鍵交換は, 一方の側だけでは決定できない共有の秘密を提供する.

source: Strings are also used to store text.
ja: stringはテキストを格納するのにも利用される

source: The server MAY send other lines of data before sending the version string.
ja: サーバは, バージョン文字列の前に別のデータを何行か送ってもよい.

source: statusInformation = receiveMessage( IN transportDomain -- snmpSSHDomain IN transportAddress -- the tmTransportAddress for the message IN wholeMessage -- the whole SNMP message from SSH IN wholeMessageLength -- the length of the SNMP message IN tmStateReference -- (NEW) transport info )
ja: statusInformation = receiveMessage( IN transportDomain -- snmpSSHDomain IN transportAddress -- メッセージの tmTransportAddress IN wholeMessage -- SSHからの SNMP メッセージ全体 IN wholeMessageLength -- SNMP の長さ IN tmStateReference -- (NEW) トランスポートの情報 )

source: Non-Signature Primitives
ja: 署名以外のプリミティブ

source: It is only used when the remote peer does not advertise a base protocol version supporting chunked encoding, i.e., a NETCONF implementation only supporting :base:1.0.
ja: リモートのピアがチャンクされたエンコーディングをサポートするベースプロトコルを告知しない場合, つまり NETCONF 実装が :base:1.0 のみをサポートする場合にのみ用いられる.

source: The "cast128-cbc" cipher is the CAST-128 cipher in CBC mode with a 128-bit key [RFC2144].
ja: "cast128-cbc" 暗号は, CBCモードで l28-bitの鍵を用いる CAST-128 暗号だ [RFC2144].

source: Unnecessary leading bytes with the value 0 or 255 MUST NOT be included.
ja: 0 か 255 の値の必要のない先行バイトは含めてはならない.

source: However, following the rekeying recommendations should prevent this attack.
ja: しかし, 次の鍵の再作成についての推奨が, この攻撃を防止するはずだ.

source: Registered names MUST NOT contain an at-sign ("@"), comma (","), whitespace, control characters (ASCII codes 32 or less), or the ASCII code 127 (DEL).
ja: 登録された名前は, アットマーク("@"), コンマ (","), スペース, 制御文字(ASCIIコード 32以下), ASCIIコードの127 (DEL)を含んではならない.

source: Throughout these documents, when the fields are referenced, they will appear within single quotes.
ja: この文書群では, フィールドが参照される場合には, シングルクォートで囲まれて表記される.

source: The client MAY also send this message instead of the normal password authentication request without the server asking for it.
ja: クライアントは, サーバから要求されない場合でも通常のパスワード認証の要求の代わりにこのメッセージを送ってもよい.

source: If the server does understand the 'channel type', but the channel still fails to open, then the server SHOULD respond with a locally assigned 'reason code' value consistent with the proposed, local 'channel type'.
ja: サーバが 'channel type' を理解するがチャンネルの開始に失敗するなら, サーバは提案されたローカルな 'channel type' に対応するローカルに割り当てられた値を返す必要がある.

source: As this example indicates, it is unsafe to use the existence of unflushed data in the TCP buffers proper as a guide to whether an empty packet is needed, since when the second write() is performed the buffers will contain the un-ACKed Record 1.
ja: この例が示すように, 空のパケットが必要かどうかのガイドとして TCPバッファに未送信のデータの存在を使うこと危険だ. 2番目のwrite()が実行されるとバッファにACKが受けとられていないRecord 1を含むからだ..

source: This process will lose entropy if the amount of entropy in K is larger than the internal state size of HASH.
ja: このプロセスは, Kのエントロピー量がHASHの内部状態のサイズよりも大きい場合, エントロピーを失なう.

source: Algorithm and Method Naming ....................................10 7.
ja: アルゴリズムと方式の命名規則 ....................................10 7.

source: [SSH-X509] provides two methods, x509v3-ecdsa-sha2-nistp256 and x509v3-ecdsa-sha2-nistp384, that MUST be used to achieve this goal.
ja: [SSH-X509] は2つの方法 x509v3-ecdsa-sha2-nistp256 と x509v3-ecdsa-sha2-nistp384 を提供しており, この目的を達成するためにこれらが用いられなければならない.

source: The "none" method is reserved, and MUST NOT be listed as supported.
ja: "none" は予約されている. しかし, サポートしている認証法として示してはならない.

source: Due to the format of secure shell binary packets, the buffer sizes needed to implement AEAD_AES_128_GCM are smaller than those required in [RFC5116].
ja: セキュアシェルのバイナリパケットの形式のために, AEAD_AES_128_GCM を実装するのに必要なバッファサイズは [RFC5116] で要求されているものよりも小さい.

source: This is illustrated in the following table, based on Section 5.6.1 of NIST 800-57 [NIST-800-57], which gives approximate comparable key sizes for symmetric- and asymmetric-key cryptosystems based on the best known algorithms for attacking them.
ja: これは, NIST 800-57 [NIST-800-57] の Section 5.6.1 に基づく次のテーブルに示されている. この表は, アルゴリズムを攻撃するときのもっとも良く知られたアルゴリズムに基づいた 対称/非対称鍵の暗号システムのおおよそ同等の鍵サイズを示している.

source: Opcodes 160 to 255 are not yet defined.
ja: 160 から 255 のオペコードはまだ定義されていない.

source: The UTF-8 mapping does not alter the encoding of US-ASCII characters.
ja: UTF-8 のマッピングは, US-ASCIIの文字のエンコーディングを変更しない.

source: The specification of the message numbers SSH_MSG_ECMQV_INIT and SSH_MSG_ECMQV_REPLY can be found in Section 7.
ja: SSH_MSG_ECMQV_INIT と SSH_MSG_ECMQV_REPLY のメッセージ番号の定義は, 7節にある.

source: Treatment of the Packet Length Field
ja: Packet Length フィールドの扱い

source: Authentication .............................................3 3.
ja: 認証 .............................................3 3.

source: In any case, the server MUST NOT allow an expired password to be used for authentication.
ja: どんな場合でも, サーバは, 期限切れのパスワードを認証に仕様してはならない.

source: The Transport Model specified in this memo is referred to as the Secure Shell Transport Model (SSHTM).
ja: このメモで指定するトランスポートモデルは, セキュアシェルトランスポートモデル (SSHTM) と呼ばれる.

source: Because naming policies might differ between administrative domains, many SSH client software packages support a user@hostname:port addressing syntax that operators can use to align non-equivalent account names.
ja: 命名のポリシーは管理ドメイン間で異なる可能性があるので, 運用者が等価でないアカウント名を整理するのに利用できるように多くの SSH クライアントソフトウェアパッケージは, user@hostname:port アドレスシンタックスをサポートしている.

source: Details on the structure and encoding of the X.509v3 certificate can be found in Section 2 of [SSH-X509].
ja: X.509v3 証明書の構造とエンコーディングの詳細は, [SSH-X509] の 2節にある.

source: The mechanism OIDs MUST be listed in order of preference, and the server must choose the first mechanism OID on the list that it supports.
ja: メカニズム OID は優先順にリストされなければならない． サーバはリストの中でサポートする最初のメカニズム OID を選択しなければならない．

source: SecSh-B uses ECDH to establish a shared secret value between the client and the server.
ja: SecSh-B は, クライアントとサーバの間で共有の秘密の値を確立するのに ECDH を用いる.

source: The server must reply to each request message with SSH_MSG_USERAUTH_SUCCESS, SSH_MSG_USERAUTH_FAILURE, or another SSH_MSG_USERAUTH_PASSWD_CHANGEREQ.
ja: サーバは, それぞれの要求のメッセージに SSH_MSG_USERAUTH_SUCCESS, SSH_MSG_USERAUTH_FAILURE, もしくは SSH_MSG_USERAUTH_PASSWD_CHANGEREQ で応答しなければならない.

source: 16 VSWTCH Switch to a different shell layer.
ja: 16 VSWTCH 別の shell layer に切り替える.

source: The keyed-hash message authentication code that is used to identify the server and verify communications is based on the hash chosen above.
ja: サーバの同定と通信の検証に用いられる鍵付きハッシュのメッセージ認証コードは, 上で選ばれたハッシュを元にする.

source: In the Key Exchange Method Names registry: The family of SSH key exchange method names beginning with "ecdh-sha2-" and not containing the at-sign ('@'), to name the key exchange methods defined in Section 4.
ja: 鍵交換法名レジストリに: "ecdh-sha2-" で始まり アットマーク('@')を含まないSSH鍵交換法名を 4節で定義した鍵交換法を指定するために登録.

source: SSH_MSG_USERAUTH_SUCCESS - The password has been changed, and authentication has been successfully completed.
ja: SSH_MSG_USERAUTH_SUCCESS - パスワードは変更された. また認証も成功し完了した.

source: The 'message' may consist of multiple lines, with line breaks indicated by CRLF pairs.
ja: この 'message' は複数行から構成されてもよい. 改行は CRLF のペアで示される.

source: SSH MUST NOT be configured using the "none" MAC algorithm for use with the SSH Transport Model.
ja: SSH を SSH トランスポートモデルで利用する際に "none" MAC アルゴリズムを利用するように設定してはならない.

source: The first line of a conforming key file MUST be a begin marker, which is the literal text:
ja: この文書に従う鍵ファイルの一行目は 開始マーカーでなければならない. マーカーは以下のテキストだ.

source: For example: "c1:b1:30:29:d7:b8:de:6c:97:77:10:d7:46:41:63:87"
ja: 例: "c1:b1:30:29:d7:b8:de:6c:97:77:10:d7:46:41:63:87"

source: In this case, the client MAY continue with a different authentication method, or request a new password from the user and retry password authentication using the following message.
ja: このとき, クライアントは別の認証法を試してもよいしユーザに新しいパスワードを要求して次のメッセージでパスワード認証を再試行してもよい.

source: AES Galois Counter Mode for the Secure Shell Transport Layer Protocol
ja: セキュアシェルトランスポート層プロトコルのための AES Galois (ガロア) カウンタモード

source: Suite B and Secure Shell ........................................3 2.1.
ja: Suite B とセキュアシェル ........................................3 2.1.

source: This message contains text to be displayed to the client user before authentication is attempted.
ja: このメッセージは, 認証が試みられる前にユーザに表示されるテキストを含んでいる.

source: Signing and verifying using this key format is performed according to the RSASSA-PKCS1-v1_5 scheme in [RFC3447] using the SHA-1 hash.
ja: この鍵フォーマットでの署名と検証は, SHA-1 ハッシュを用いる RSASSA-PKCS1-v1_5 scheme in [RFC3447] に従って行なわれる.

source: However, this algorithm is still REQUIRED for historical reasons; essentially, all known implementations at the time of this writing support this algorithm, and it is commonly used because it is the fundamental interoperable algorithm.
ja: しかし, このアルゴリズムは歴史的な理由により依然要求されている; 実質的な面から見て, 執筆時点でのすべての知られた実装はこのアルゴリズムを実装しており, 基本的な相互運用可能なアルゴリズムであるという理由で広く用いられているからだ.

source: The MAC algorithms for each direction MUST run independently, and implementations MUST allow choosing the algorithm independently for both directions.
ja: MACのアルゴリズムは, 通信の方向それぞれで独立に動作しなければならない. また, 実装は方向それぞれについてアルゴリズムを独立に選択できなければならない.

source: An SMI number (189) under mib-2, for the MIB module in this document.
ja: この文書の MIBモジュールのための mib-2 の下での SMI 番号 (189).

source: Since DNSSEC only protects the integrity of the host key fingerprint after it is signed by the DNS zone administrator, the fingerprint must be transferred securely from the SSH host administrator to the DNS zone administrator.
ja: DNSSEC は, DNS ゾーン管理者によって署名されたホスト鍵の指紋の完全性のみを保証するので, SSH ホスト管理者からDNS ゾーン管理者に対して指紋が安全に転送されなければならない.

source: The reader is expected to have read and understood the description of the SNMP architecture, as defined in [RFC3411], and the Transport Subsystem architecture extension specified in "Transport Subsystem for the Simple Network Management Protocol (SNMP)" [RFC5590].
ja: 読者は, [RFC3411]で定義された SNMP アーキテクチャの詳細を読み理解していることが期待されている. また, "Transport Subsystem for the Simple Network Management Protocol (SNMP)" [RFC5590] で指定されたトランスポートサブシステムアーキテクチャ拡張についても読み理解していることが期待されている.

source: Most key-exchange algorithms are able to authenticate the SSH server's identity to the client.
ja: ほとんどの鍵交換アルゴリズムは, SSHサーバの識別情報をクライアントに認証することができる.

source: Key and Initialization Vector Derivation
ja: 鍵と初期化ベクトルの導出

source: We have chosen to identify algorithms, methods, formats, and extension protocols with textual names that are of a specific format.
ja: 我々は, アルゴリズムや方式, フォーマット, 拡張プロトコルを特定の形式を持つテキスト名で識別することを選んだ.

source: In such cases, the data is first hashed with HASH to compute H, and H is then hashed again as part of the signing operation.
ja: この場合, データはまず H を計算するために HASH でハッシュされる. そして H は署名の計算の一部分として再度ハッシュされる.

source: To implement CBC mode, outer chaining MUST be used (i.e., there is only one initialization vector).
ja: CBCモードの実装には, outer chaining が使われなければならない(すなわち, 初期化ベクトルを1つだけ用いる).

source: Key exchange begins by each side sending the following packet:
ja: 鍵交換は, それぞれの側が次のパケットを送ることで開始する.

source: The GSS-API context used with this method is always that established during an initial GSS-API-based key exchange.
ja: この方法で利用される GSS-API コンテキストは, 最初の GSS-API ベース鍵交換で確立されたものが常に利用される.

source: Data Transfer
ja: データ転送

source: Here the 'e' and 'n' parameters form the signature key blob.
ja: ここで, パラメータ 'e', 'n' は署名のkey blob を生成する

source: The Disconnection Message 'reason code' is a uint32 value.
ja: 切断メッセージの 'reason code' は uint32 の値だ.

source: The choice of signature algorithm used by any given certificate or OCSP response is independent of the signature algorithms chosen by other elements in the chain.
ja: 証明書や OCSP 応答で用いられる署名アルゴリズムの選択は, チェーンの他の要素で選択された署名アルゴリズムと独立だ.

source: If more than 2**32 packets are encrypted and MACed by the SSH Transport Protocol between rekeyings, then the SSH Transport Protocol may become vulnerable to replay and re-ordering attacks.
ja: 再生成の間にSSHトランスポートプロトコルによって2**32 パケット以上暗号化とMACが行なわれると, SSHトランスポートプロトコルは 再生攻撃や再順序攻撃(re-ordering attack)に脆弱となるかもしれない.

source: However, it will also allow NETCONF over SSH traffic to be more easily identified by attackers.
ja: しかし, SSH トラフィック上の NETCONFを攻撃者もより容易に識別できるようになる.

source: The RSA key-exchange method consists of three messages.
ja: RSA 鍵交換法は3つのメッセージで構成される.

source: The subjectAlternativeName X.509v3 extension, as described in Section 4.2.1.6 of [RFC5280], SHOULD be used to convey the server host name, using either dNSName entries or iPAddress entries to convey domain names or IP addresses as appropriate.
ja: [RFC5280] の 4.2.1.6 節で記述されている subjectAlternativeName X.509v3 拡張 を, 必要に応じてドメイン名かIPアドレスを伝えるために dNSName エントリか iPAddress エントリを用いて, サーバホスト名を伝えるために利用される必要がある.

source: The available types and their interpretation depend on the type of channel.
ja: 利用できる種類とその解釈は, チャンネルの種類に依存する.

source: If an implementation uses the OpenSSL libraries, a group consisting of a 1024-bit safe prime and 2 as generator can be created as follows:
ja: 実装がOpenSSLのライブラリを利用する場合, 1024-bit の安全な素数と 2 を生成器として持つ群は以下のように作成できる:

source: Hosts MAY have multiple host keys using multiple different algorithms.
ja: ホストは異なるアリゴリズムを用いる複数のホスト鍵を持ってもよい.

source: In that case, the user SHOULD be given a warning that the offered host key does not match the host key cached on the client.
ja: この時, 提供されたホスト鍵とクライアントにキャッシュされたホスト鍵が一致しないという警告をシステムはユーザに与える必要がある.

source: When SSH_MSG_USERAUTH_SUCCESS has been sent, any further authentication requests received after that SHOULD be silently ignored.
ja: SSH_MSG_USERAUTH_SUCCESS を送ったら, その後に受け取った認証の要求は静かに無視する必要がある.

source: Certificate Extensions
ja: 証明書の拡張

source: The following symbols are used in this description:
ja: この記述では次の記号を利用する:

source: The following steps are used to exchange a key.
ja: 鍵を交換するために次の手順が使われる.

source: If the server rejects the authentication request, it MUST respond with the following:
ja: サーバが認証の要求を拒否するなら, 次のメッセージで返答しなければならない:

source: o The operations that the user is allowed to perform using the connection protocol.
ja: o コネクションプロトコルを利用してユーザに実行を許可する操作

source: value (hex) representation (hex) ----------- -------------------- 0 00 00 00 00 9a378f9b2e332a7 00 00 00 08 09 a3 78 f9 b2 e3 32 a7 80 00 00 00 02 00 80 -1234 00 00 00 02 ed cc -deadbeef 00 00 00 05 ff 21 52 41 11
ja: 値 (hex) 表現 (hex) ----------- -------------------- 0 00 00 00 00 9a378f9b2e332a7 00 00 00 08 09 a3 78 f9 b2 e3 32 a7 80 00 00 00 02 00 80 -1234 00 00 00 02 ed cc -deadbeef 00 00 00 05 ff 21 52 41 11

source: The hash algorithm for computing the exchange hash is defined by the method name, and is called HASH.
ja: 交換ハッシュを計算するハッシュ関数は, 方法の名前で定義される. これを HASH と呼ぶ.

source: The server MAY reply with an SSH_MSG_USERAUTH_SUCCESS message if no authentication is required for the user in question.
ja: サーバは, ユーザに要求された認証がない場合に SSH_MSG_USERAUTH_SUCCESS メッセージで応答してもよい.

source: Support for the DNS-ID identifier type is RECOMMENDED in client and server software implementations.
ja: DNS-ID 識別子型のサポートが クライアントとサーバのソフトウェア実装で推奨される.

source: After the client receives SSH_MSG_USERAUTH_GSSAPI_RESPONSE, the client and server exchange SSH_MSG_USERAUTH_GSSAPI_TOKEN packets until the authentication mechanism either succeeds or fails.
ja: クライアントが SSH_MSG_USERAUTH_GSSAPI_RESPONSE を受け取ったら， 認証メカニズムが成功か失敗するまで SSH_MSG_USERAUTH_GSSAPI_TOKEN パケットをクライアントとサーバで交換する．

source: Clients SHOULD NOT add any additional characters to the prompt, such as ": " (colon-space); the server is responsible for supplying all text to be displayed to the user.
ja: クライアントは, ": " (コロン-スペース)のような追加の文字を prompt に足さないほうがよい. サーバは, ユーザの表示されるすべての文字列を提供する責任がある.

source: A key exchange method uses implicit server authentication if, in order to prove its authenticity, the server also has to prove that it knows the shared secret, K, by sending a message and a corresponding MAC that the client can verify.
ja: サーバの信頼性を証明するために, クライアントがメッセージと関連するMACを検証するためにサーバが共有の秘密 K を知っていることを示す必要がある場合には, 鍵交換法は暗黙のサーバ認証を用いる.

source: The SSH ECC public key algorithm is defined by its key format, corresponding signature algorithm ECDSA, signature encoding, and algorithm identifiers.
ja: SSH ECC 公開鍵アルゴリズムは, その鍵のフォーマットや対応する署名アルゴリズム ECDSA, 署名のエンコーディング, アルゴリズムの識別子で定義される.

source: This document describes how to use client authentication as described in "The Secure Shell (SSH) Authentication Protocol" [RFC4252].
ja: この文書は, "The Secure Shell (SSH) Authentication Protocol" [RFC4252] で記述されている, クライアント認証を利用する方法を記述する.

source: As described in Section 4.1, the user may be free to accept the new key and continue the session.
ja: 4.1 節で記述したように, ユーザは新しい鍵を受け入れてセッションを継続してもよい.

source: The Elliptic Curve Digital Signature Algorithm (ECDSA) is specified for use with the SSH ECC public key algorithm.
ja: 楕円曲線 Digital Signature Algorithm (ECDSA) は, SSHの楕円曲線公開鍵アルゴリズムの共に利用するために指定される.

source: In order to solve this problem, and at the same time be compatible with existing implementations, this document defines the following framing protocol.
ja: この問題を解決し同時に既存の実装と互換するため, この文書は次のフレーミングプロトコルを定義する.

source: The client has the freedom to try the methods listed by the server in any order.
ja: クライアントは, サーバによって示された方法をどの順番で試しても構わない.

source: Encoding of Terminal Modes
ja: ターミナルモードのエンコーディング

source: Protocol fields and possible values to fill them are defined in this set of documents.
ja: プロトコルのフィールドとフィールドで取り得る値は , この文書群で定義される.

source: This section lists major changes between this document and RFC 4742.
ja: この節は, この文書と RFC 4742 の主な変更点を挙げる.

source: The block B1 is then XORed with P1 to generate the ciphertext block C1.
ja: 次にブロック B1 を P1 と XORし 暗号文ブロック C1 を生成する.rtext block C1.

source: The client requests a modulus from the server indicating the preferred size.
ja: クライアントは, 適切なサイズを指定するサーバから法(modulus)を要求する.

source: It computes K = e ^ y mod p, and H = hash(V_C || V_S || I_C || I_S || K_S || e || f || K).
ja: K = e ^ y mod p, と H = hash(V_C || V_S || I_C || I_S || K_S || e || f || K) を計算する.

source: Implementations MAY include the quotation marks.
ja: 実装は, この引用符を含んでもよい.

source: If the server does not implement a critical attribute, it MUST fail the add, with the status code SSH_PUBLICKEY_ATTRIBUTE_NOT_SUPPORTED.
ja: サーバが criticalな属性をサポートしない場合は, 状態コード SSH_PUBLICKEY_ATTRIBUTE_NOT_SUPPORTED で追加に失敗しなければならない.

source: Some host keys may not support both signatures and encryption (this can be determined from the algorithm), and thus not all host keys are valid for all key exchange methods.
ja: ホスト鍵によっては, 署名と暗号化の両方をサポートしない(これはアルゴリズムによって決まる). このため, すべてのホスト鍵がすべての鍵交換法で有効とはならない.

source: Suite B places no constraints on how frequently this is to be done, but it does require that the cipher suite being employed MUST NOT be changed when a rekey occurs.
ja: Suite B は, この鍵の再生成がどれくらい頻繁に行なわれるかの制限を設けていない. しかし鍵の再生成時に採用される暗号スイートを変更してはならないことを要求する.

source: The encoding of the elliptic curve point Q_C as an octet string is as specified in Section 2.3.3 of [SEC1], and the encoding of the ECDSA signature Sig_S as an octet string is as described in Section 3.1.2 of [SSH-ECC].
ja: 楕円曲線のポイント Q_C のオクテット文字列としてのエンコーディングは [SEC1] の 2.3.3 節で指定されている. ECDSA 署名 Sig_S のオクテット文字列としてのエンコーディングは, [SSH-ECC] の 3.1.2 節に記述されている.

source: It provides a simple mechanism for the client to manage public keys on the server.
ja: サーバ上の公開鍵を管理するクライアントのための簡単なメカニズムを提供する.

source: The value for dss_signature_blob is encoded as a string containing r, followed by s (which are fixed-length 160-bit integers, without lengths or padding, unsigned, and in network byte order).
ja: dss_signature_blob の値は, (それぞれ長さやパディングがない符号無しのネットワークバイトオーダーの160-bitの整数である) r とそれに続く s を含む文字列としてエンコードされる.

source: A NETCONF over SSH session consists of the manager and agent exchanging complete XML documents.
ja: SSHセッション上の NETCONF は, マネージャとエージェントの完全な XML 文書の交換で構成される.

source: In most cases, where speed and code size are not critical issues, the algorithms specified by [RFC4344] should be used instead.
ja: 多くの場合では, 速度とコードサイズは重大な問題ではないので, [RFC4344] で指定されたアルゴリズムをかわりに使う必要がある.

source: Increment the snmpSshtmSessionOpens counter.
ja: snmpSshtmSessionOpens カウンタをインクリメントする.

source: This method works by sending a signature created with a private key of the user.
ja: ユーザの秘密鍵で作られた署名を送ることで, この認証法は動作する.

source: For this reason, it is RECOMMENDED that debug messages be initially disabled at the time of deployment and require an active decision by an administrator to allow them to be enabled.
ja: これらの理由から, デバッグメッセージは配置時には無効にされていて, 管理者が能動的に有効する必要があることが推奨される.

source: Client implementations SHOULD reject this request; it is normally sent only by the client.
ja: クライアントの実装はこの要求を拒否する必要がある. これは通常クライアントからのみ送られる.

source: This document addresses the requirement for the SSH client to authenticate the SSH server and for the SSH server to authenticate the SSH client, and describes how SNMP can make use of the authenticated identities in authorization policies for data access, in a manner that is independent of any specific Access Control Model.
ja: この文書は, SSHクライアントがSSHサーバを認証しSSHサーバがSSHクライアントを認証する要件を説明し, 特定のアクセスコントロールモデルに依存しない方式で, データアクセスのための認証ポリシーを用いて認証された識別情報をどのようにSNMPが用いることができるかを記述する.

source: Extended Channel Data Transfer 'data_type_code' values MUST be assigned sequentially.
ja: 拡張チャンネルデータ転送の 'data_type_code' の値は, 連続して割り当てられなければならない.

source: Either side MUST NOT send or accept e or f values that are not in the range [1, p-1].
ja: どちらの側も [1, p-1]の範囲にない e や f の値を送ったり受け入れたりしてはならない.
